{"pages":[{"title":"Welcome to Xinru Jia&#39;s Personal Homepage!","text":"About me Education &amp; Experience Reaserch Direction Honors Social Activities My Posts Categories About meI am Xinru Jia(贾心茹), Currently I am a Master student at Fudan University, advised by Qi Liu in the Frontier Institute of Chip and System &amp; Microelectronics, Fudan Univesity. I am also working closely with Chixiao Chen. Education &amp; Experience 2013.09 - 2016.06, No.1 Middle School, Taian, Shandong 2019.09 - 2020.06, Dalian University of Technology(DUT), IC Design and Integrated System 2020.09 ~ , Fudan Univesity, IC and System Design Reaserch Direction Key word Spotting Artificial Intelligence Processor Computing in Memory Honors 2016 - 2017 National Scholarship 2017 Merit Student of Dalian 2017 - 2018 National Scholarship 2017 Provincial first prize in tiche 9th National Mathematics Competition for College Students 2018 - 2019 National Scholarship 2020 Outstanding graduate of LiaoNing Province Social Activities Youth League Secretary of Micro Electronic in DUT Office Minister of Student Union in DUT My PostsCategories KWS [*Computer and Intelligent Processor Architecture*](/categories/Computer and Intelligent Processor Architecture)","link":"/Home/index.html"},{"title":"Welcome to Xinru Jia&#39;s Personal Homepage!","text":"About me Education &amp; Experience Reaserch Direction Honors Social Activities About meI am Xinru Jia(贾心茹), Currently I am a Master student at Fudan University, advised by Qi Liu in the Frontier Institute of Chip and System &amp; Microelectronics, Fudan Univesity. I am also working closely with Chixiao Chen. Education &amp; Experience 2013.09 - 2016.06, No.1 Middle School, Taian, Shandong 2019.09 - 2020.06, Dalian University of Technology(DUT), IC Design and Integrated System 2020.09 ~ , Fudan Univesity, IC and System Design Reaserch Direction Key word Spotting Artificial Intelligence Processor Computing in Memory Honors 2016 - 2017 National Scholarship 2017 Merit Student of Dalian 2017 - 2018 National Scholarship 2017 Provincial first prize in tiche 9th National Mathematics Competition for College Students 2018 - 2019 National Scholarship 2020 Outstanding graduate of LiaoNing Province Social Activities Youth League Secretary of Micro Electronic in DUT Office Minister of Student Union in DUT","link":"/about/index.html"}],"posts":[{"title":"如何设计一个AI加速器","text":"MFCC Hamming Window FFT log Cordic Neural Network MFCCHamming WindowFFTlogCordicNeural Network等我什么时候心情好就来更titi xiong $x=122$ 123import pynqol = pynq.Overlay(mybit, download=True) 122 123 123 123","link":"/2021/04/24/fft-accelerator/"},{"title":"CA-HW-1","text":"HW_1The assignment of HW_1.I will adjust the format and combine problem and solution to be more suitable for markdown, but you can get and edit it in Overleaf by the source file. Problem 1: Implement a simple RISC Core (2+5+8=15 Points) On class, we define an extremely simple RISC ISA and its hardware organization, which are both shown below. For this homework assignment, we need to design/implement/simulate this core. Problem(a)Which HDL you want to use ? Solution(a)System Verilog Problem(b)For Verilog-players, please write an top-level structural verilog file to decribe the system. For C-players, please complete a header filer and .cc file , compatible to Vivado HLS, to describe the system. (Hint: Please submit your script as well) Solution(b)In the attachment I submitted, The tb-top.v is my testbench, and top.v is the top file of the whole core mudule, including 5 subfiles for circuit sub-module. You can run testbench.v file to get the simulated waveform. I also submitted the waveform file, whose screencut at the bottom of the document. Problem(c)For Verilog-players, please write a testbench verilog file to simulate the system. It should complete a 4-MAC (neuron) computing. For C-players, please complete a test.cc file , compatible to Vivado HLS, to simulate the system. It should complete a 4-MAC (neuron) computing. (Hint: Please submit your script and simulated waveform, highlight the final results and compare it with the theoretical value.)","link":"/2021/04/30/CA-HW-1/"},{"title":"Computer and Intelligent Processor Architecture","text":"写在开头:&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&ensp;此课程为复旦大学工研院陈迟晓老师开设的计算机与智能处理器体系结构线上课程。你可以在elearning课程主页上找到关于该课程的所有课程视频，课程ppt，三次小作业和最终project。同时有未知同学将该课程搬运到bilibili，但不属于老师本人维护，请大家尽可能在课程主页上学习，方便及时掌握更新内容。&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&ensp;本学期我将该课程作为培养方案中的跨一级选修，在个人博客上同步更新每次作业思路，源代码及课程提交报告详见我的github repo，希望能给学习该课程的同学提供一点帮助，也希望各位同学批评指正。&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&ensp;同时提供几门课程及书籍作为该课程的前置参考资料： csapp 必须承认，作为硬件学习者csapp yyds，每个作业都非常经典且有趣，而且是非常基础的课程（虽然懒惰的我并没有全做完，但是作业答案各种开源代码还蛮多的，等我有空也可以在github开源一份，但可能懒得写blog 深入理解计算机系统 这本书的原作者就是csapp的主讲老师，csapp也是基于该书进行课程讲解，如果没时间看视频可以配合学习 计算机体系结构:量化研究方法 这本书需要在上述基础上进行学习，目前更新到第六版，但是第六版说翻译了两年了也没见中文版出现，超链接为浙大课程共享中的第六版英文版，同时同一个repo下也有其他几版教材中英版本 人工智能芯片设计 这本书由清华大学尹首一撰写，比较适合神经网络的入门（当然也适合写本子，逃～ 如果你是复旦大学微电子学院本科生，同样欢迎选修严昌浩老师（or 曾璇）教授的计算机软件基础，和韩军老师教授的专用集成电路系统专题讲座(名义讲座，实则硬核，但是有个助教小哥哥很帅，另一个助教小哥哥超强 待补充~","link":"/2021/04/30/Computer-and-Intelligent-Processor-Architecture/"}],"tags":[],"categories":[{"name":"KWS","slug":"KWS","link":"/categories/KWS/"},{"name":"Computer and Intelligent Processor Architecture","slug":"Computer-and-Intelligent-Processor-Architecture","link":"/categories/Computer-and-Intelligent-Processor-Architecture/"}]}